SELECT
  ES.[部門コード]
, ES.[営業部名]
, ES.[拠点コード]
, ES.[拠点名]
, ES.[顧客No]
, ES.[顧客名]
, ES.[受注番号]
, ES.[受注承認日]
, ES.[売上承認日]
, ES.[納期]
, ES.[売上金額]
, ES.[計上月]
FROM
(
SELECT [部門コード],[営業部名],[拠点コード],[拠点名],[顧客No],[顧客名],[受注番号],[受注承認日],[売上承認日],[納期],[売上金額],[計上1年目] AS [計上月] FROM [JunpDB].[dbo].[vMicES売上予想]
UNION SELECT [部門コード],[営業部名],[拠点コード],[拠点名],[顧客No],[顧客名],[受注番号],[受注承認日],[売上承認日],[納期],[売上金額],[計上2年目] AS [計上月] FROM [JunpDB].[dbo].[vMicES売上予想]
UNION SELECT [部門コード],[営業部名],[拠点コード],[拠点名],[顧客No],[顧客名],[受注番号],[受注承認日],[売上承認日],[納期],[売上金額],[計上3年目] AS [計上月] FROM [JunpDB].[dbo].[vMicES売上予想]
UNION SELECT [部門コード],[営業部名],[拠点コード],[拠点名],[顧客No],[顧客名],[受注番号],[受注承認日],[売上承認日],[納期],[売上金額],[計上4年目] AS [計上月] FROM [JunpDB].[dbo].[vMicES売上予想]
UNION SELECT [部門コード],[営業部名],[拠点コード],[拠点名],[顧客No],[顧客名],[受注番号],[受注承認日],[売上承認日],[納期],[売上金額],[計上5年目] AS [計上月] FROM [JunpDB].[dbo].[vMicES売上予想]
UNION SELECT [部門コード],[営業部名],[拠点コード],[拠点名],[顧客No],[顧客名],[受注番号],[受注承認日],[売上承認日],[納期],[売上金額],[計上6年目] AS [計上月] FROM [JunpDB].[dbo].[vMicES売上予想]
) AS ES
where 計上月 >= '2021/08' and 計上月 <= '2022/08' --and [部門コード] = '081'
ORDER BY [部門コード], [顧客No], [計上月]